Revit 2027 API
FluidTemperature.Viscosity Property
 The dynamic viscosity value
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Viscosity { get; set; }
Public Property Viscosity As Double
	Get
	Set
public:
property double Viscosity {
	double get ();
	void set (double value);
}
member Viscosity : float with get, set
Property Value
Double
See Also
Reference
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace